constant/dropletProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dropletProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//--- Schmidt number

Sc0	[0 0 0 0 0 0 0] 1; 
Sc1	[0 0 0 0 0 0 0] 1;
Sc2	[0 0 0 0 0 0 0] 1;
Sc3	[0 0 0 0 0 0 0] 1;
Sc4	[0 0 0 0 0 0 0] 1;
Sc5	[0 0 0 0 0 0 0] 1;
Sc6	[0 0 0 0 0 0 0] 1;
Sc7	[0 0 0 0 0 0 0] 1;
Sc8	[0 0 0 0 0 0 0] 1;
Sc9	[0 0 0 0 0 0 0] 1;                	

//--- diameter 

dW0	[0 1 0 0 0 0 0] 65.7e-06;
dW1	[0 1 0 0 0 0 0] 71.4e-06;
dW2	[0 1 0 0 0 0 0] 77.1e-06;
dW3	[0 1 0 0 0 0 0] 93.8e-06;
dW4	[0 1 0 0 0 0 0] 121.3e-06;
dW5	[0 1 0 0 0 0 0] 148.8e-06;
dW6	[0 1 0 0 0 0 0] 176.3e-06;
dW7	[0 1 0 0 0 0 0] 225.0e-06;
dW8	[0 1 0 0 0 0 0] 295.0e-06;
dW9	[0 1 0 0 0 0 0] 365.0e-06;               

// ************************************************************************* //
