constant/scalarSourceW
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

sourceW_fvOPT
{
    type            scalarSemiImplicitSource;	
    active          true;
    timeStart       2;
    duration        10;
    selectionMode   cellSet; 	//OPTIONS: 'all', 'cellSet', 'cellZone', 'points'
    cellSet         sourceWset;
    fields 	    (W0,W1,W2,W3,W4,W5,W6,W7,W8,W9);
    volumeMode      absolute;	//OPTIONS: 'absolute' (scalar units, e.g. [kg]), 'specific' (salar units, e.g. [kg/m3])
    injectionRateSuSp 
     {
	 W0 (8.75e-05 0);	//two coefficients needed (<scalarValue> <0>)
	 W1 (2.17e-04 0);	//two coefficients needed (<scalarValue> <0>)
	 W2 (3.73e-04 0);	//two coefficients needed (<scalarValue> <0>)
	 W3 (3.02e-04 0);	//two coefficients needed (<scalarValue> <0>)
	 W4 (2.18e-03 0);	//two coefficients needed (<scalarValue> <0>)
         W5 (1.15e-03 0);	//two coefficients needed (<scalarValue> <0>)
	 W6 (6.03e-04 0);	//two coefficients needed (<scalarValue> <0>)
	 W7 (5.51e-04 0);	//two coefficients needed (<scalarValue> <0>)
	 W8 (1.67e-04 0);	//two coefficients needed (<scalarValue> <0>)
	 W9 (6.40e-05 0);	//two coefficients needed (<scalarValue> <0>)
     }
}

// ************************************************************************* //
